Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: 1 is the first radio button (according to original creation order), 2 is the second, and so on.
ja: 1は1番目のラジオボタン（オリジナル作成順）、2は2番目のラジオボタン、といった具合に。

source: 1) "Up" does not work with controller buttons; and 2) An "Up" hotkey without a normal/down counterpart hotkey will completely take over that key to prevent it from getting stuck down.
ja: 1) "Up"はコントローラーのボタンでは動作しない。2) "Up"ホットキーに対応する通常のホットキー/ダウンホットキーがない場合、そのキーが完全に引き継がれ、押したままになるのを防ぐ。

source: 1) "Up" does not work with joystick buttons; and 2) An "Up" hotkey without a normal/down counterpart hotkey will completely take over that key to prevent it from getting stuck down.
ja: 1）"Up"はジョイスティックボタンでは動作しません。2）"Up"のホットキーで通常／下対応のホットキーがない場合、そのキーが完全に引き継がれ、downがスタックするのを防ぎます。

source: 1) "b" when you type "a"; 2) uppercase "B" when you type uppercase "A"; and 3) Ctrl+B when you type Ctrl+A.
ja: 1）「a」と入力したときに「b」、2）大文字の「A」と入力したときに「B」、3）「Ctrl+B」と入力したときに「Ctrl+A」。。

source: 1) hotstrings; 2) one or more hotkeys that require the keyboard hook (most do not); 3) SetCaps/Scroll/NumLock AlwaysOn/AlwaysOff; 4) active Input hooks.
ja: 1)ホットストリング、2) キーボードフックを必要とする1つまたは複数のホットキー（ほとんどは必要ありません）、3)SetCaps/Scroll/NumLock AlwaysOn/AlwaysOff、4) アクティブな入力フックです。

source: 1) Function has no MinParams property; or 2) the & option is used with the standard 32-bit calling convention.
ja: 1)Functionに MinParamsプロパティがない、または2)&オプションが標準32ビット呼び出し規約で使用されている。

source: 1) Hold down Alt and LEFT-click anywhere inside a window to drag it to a new location; 2) Hold down Alt and RIGHT-click-drag anywhere inside a window to easily resize it; 3) Press Alt twice, but before releasing it the second time, left-click to minimize the window under the mouse cursor, right-click to maximize it, or middle-click to close it.
ja: 1) Altを押しながらウィンドウ内の任意の場所を左クリックし、新しい場所にドラッグする。2) Altを押しながらウィンドウ内の任意の場所を右クリック・ドラッグし、ウィンドウのサイズを簡単に変更する。3) Altを2回押し、2回目を離す前にマウスカーソル下のウィンドウを左クリックで最小化、右クリックで最大化、または中クリックで閉じる。

source: 1) It always contains the absolute/complete path of the file even if FilePattern contains a relative path; 2) Any short (8.3) folder names in FilePattern itself are converted to their long names; 3) Characters in FilePattern are converted to uppercase or lowercase to match the case stored in the file system.
ja: 1)FilePatternに相対パスが含まれていても、常にファイルの絶対パス/完全パスを含む。 2)FilePattern自体に含まれる短い（8.3）フォルダ名は、その長い名前に変換される。 3)FilePattern内の文字は、ファイルシステムに保存されているケースに合わせて大文字または小文字に変換される。

source: 1) Pass MyVar as a "Str" argument rather than as a Ptr/address; 2) Call VarSetStrCapacity(&MyVar, -1) to update the variable's internally-stored length after calling DllCall.
ja: 1)MyVarをPtr/アドレスとしてではなく、"Str"引数として渡す。2) DllCallを呼び出した後、VarSetStrCapacity(&MyVar, -1)を呼んで変数の内部に保存された長さを更新します。

source: 1) Pass MyVar as a "Str" argument rather than as a Ptr/address; 2) Call VarSetStrCapacity(MyVar, -1) to update the variable's internally-stored length after calling DllCall.
ja: 1)MyVarをPtr/アドレスとしてではなく、"Str"引数として渡す。2) DllCallを呼び出した後、VarSetStrCapacity(MyVar, -1)を呼んで変数の内部に保存された長さを更新します。

source: 1) Run minimized; 2) Capture output.
ja: 1) 最小限の実行、2) 出力の捕捉。

source: 1) Standard file-open or file-save dialogs; 2) Explorer windows; 3) Console (command prompt) windows.
ja: 1) 標準的なファイルを開く、またはファイルを保存するダイアログ、2) エクスプローラーウィンドウ、3) コンソール（コマンドプロンプト）ウィンドウ。

source: 1) Start Menu appearance during Win keystrokes (LWin/RWin); 2) menu bar activation during Alt keystrokes.
ja: 1）Winキー操作時のスタートメニュー表示（LWin/RWin）、2）Altキー操作時のメニューバー起動。

source: 1) Whether the hotkey to be overridden is a hook hotkey in the other script (non-hook hotkeys can always be overridden); 2) The fact that the most recently started script's hotkeys generally take precedence over those in other scripts (therefore, if the script intending to override was started most recently, its override should always succeed); 3) Whether the enabling or creating of this hotkey will newly activate the keyboard or mouse hook (if so, the override will always succeed).
ja: 1) オーバーライドするホットキーが他のスクリプトのフックホットキーであるかどうか（フックでないホットキーは常にオーバーライド可能）、2) 最も最近起動したスクリプトのホットキーが他のスクリプトのそれよりも一般的に優先されるという事実（したがって、オーバーライドしようとするスクリプトが最も最近起動した場合、そのオーバーライドは常に成功します）、 3) このホットキーを有効または作成することによってキーボードまたはマウスフックを新たにアクティブ化するかどうか（その場合、オーバーライドは必ず成功します）。

source: 1) fire a hotstring even if it lacks the question mark option; 2) prevent a firing when something you type after clicking the mouse accidentally forms a valid abbreviation with what you typed before.
ja: 1) ホットストリングがクエスチョンマークオプションを欠いていても発射します。2) マウスをクリックした後に入力したものが、誤って前に入力したものと有効な略語を形成した場合に発射されるのを防止します。

source: 1) has too much text to be fully displayed; or 2) has an icon but no text.
ja: 1) テキストが多すぎて表示しきれない、または 2) アイコンはあるがテキストがない。

source: 1) the environment variables TMP, TEMP, or USERPROFILE; 2) the Windows directory.
ja: 1)環境変数TMP、TEMP、またはUSERPROFILE、2) Windowsディレクトリ。

source: 1) the timer does not exist:
ja: 1) タイマーが存在しない：

source: 1) there are no matching windows; 2) the window has no transparency color; or 3) other conditions (caused by OS behavior) such as the window having been minimized, restored, and/or resized since it was made transparent.
ja: 1)一致するウィンドウがない、2)ウィンドウに透明色がない、3)ウィンドウが透明になってから最小化、復元、サイズ変更されたなどの他の条件（OSの動作による）。

source: 10 (RT_RCDATA): Every single other extension.
ja: 10（RT_RCDATA）：他のすべてのエクステンション。

source: 12 (RT_GROUP_CURSOR): .cur (not yet supported)
ja: 12（RT_GROUP_CURSOR）：.cur（未対応）

source: 12 = Combination of the above two.
ja: 12 = 上記2つの組み合わせ。

source: 15 was too low since the system tick count updates in steps of 15 or 16 minimum; i.e. if the tick count updated at exactly the wrong moment, the thread could become interruptible even though virtually no time had passed.
ja: システムのティックカウントは最小15または16のステップで更新されるため、15は低すぎます。つまり、ティックカウントが正確に間違ったタイミングで更新されると、実質的に時間が経過していないにもかかわらず、スレッドが中断される可能性があります。

source: 18000 (i.e. 180 degrees):
ja: 18000（つまり180度）：

source: 18000 (i.e. 180 degrees): backward POV
ja: 18000（つまり180度）：後方視線

source: 1: The window is maximized (WinRestore can unmaximize it).
ja: 1：ウィンドウが最大化されています（WinRestoreは最大化を解除できます）。

source: 2 (SEEK_END): End of the file.
ja: 2（SEEK_END）：ファイル終了。

source: 2 - Hotkeys & Hotstrings
ja: 2 - ホットキーとホットストリング

source: 2 - Only run when UPX compression is specified.
ja: 2 - UPX圧縮が指定されている場合にのみ実行される。

source: 2 = Clipboard contains something entirely non-text such as a picture.
ja: 2 = クリップボードには、画像など、テキストではないものが格納されています。

source: 2 = Fail-safe with network boot
ja: 2 = ネットワークブートによるフェイルセーフ

source: 2 = Omit seconds.
ja: 2 = 秒を省略します。

source: 2 = Reboot
ja: 2 = 再起動

source: 2 = Use long date (meaningful only when Format is blank; not compatible with 1 and 8).
ja: 2 = 長い日付を使用する（Formatが空白の場合のみ意味がある、1および8とは互換性がない）。

source: 2 Release -- use ObjRelease instead
ja: 2 Release -- ObjReleaseの代わりに使用

source: 2) the timer already exists:
ja: 2) タイマーが既に存在する：

source: 2-hooks: The hotkey requires both the hooks mentioned above.
ja: 2-hooks：このホットキーには、上記の両方のフックが必要です。

source: 2.0.1 - January 1, 2023
ja: 2.0.1 - 2023年1月1日

source: 2.0.10 - September 24, 2023
ja: 2.0.10 - 2023年9月24日

source: 2.0.11 - December 23, 2023
ja: 2.0.11 - 2023年12月23日

source: 2.0.12 - March 23, 2024
ja: 2.0.12 - 2024年3月23日

source: 2.0.13 - April 20, 2024
ja: 2.0.13 - 2024年4月20日

source: 2.0.14 - May 6, 2024
ja: 2.0.14 - 2024年5月6日

source: 2.0.15 - May 16, 2024
ja: 2.0.15 - 2024年5月16日

source: 2.0.16 - May 30, 2024
ja: 2.0.16 - 2024年5月30日

source: 2.0.17 - June 5, 2024
ja: 2.0.17 - 2024年6月5日

source: 2.0.18 - July 6, 2024
ja: 2.0.18 - 2024年7月6日

source: 2.0.19 - January 25, 2025
ja: 2.0.19 - 2025年1月25日

source: 2.0.2 - January 2, 2023
ja: 2.0.2 - 2023年1月2日

source: 2.0.3 - June 19, 2023
ja: 2.0.3 - 2023年6月19日

source: 2.0.4 - July 3, 2023
ja: 2.0.4 - 2023年7月3日

source: 2.0.5 - August 12, 2023
ja: 2.0.5 - 2023年8月12日

source: 2.0.6 - August 30, 2023
ja: 2.0.6 - 2023年8月30日

source: 2.0.7 - September 2, 2023
ja: 2.0.7 - 2023年9月2日

source: 2.0.8 - September 11, 2023
ja: 2.0.8 - 2023年9月11日

source: 2.0.9 - September 17, 2023
ja: 2.0.9 - 2023年9月17日

source: 27000 (i.e. 270 degrees):
ja: 27000（つまり270度）：

source: 27000 (i.e. 270 degrees): left POV
ja: 27000（つまり270度）：左視点

source: 3 - Sending Keystrokes
ja: 3 - キー入力の送信

source: 32-bit processes not only have different environment variables, but also have file system redirection in place for compatibility reasons.
ja: 32ビットプロセスは、環境変数が異なるだけでなく、互換性のためにファイルシステムのリダイレクトが行われている。

source: 4 - Running Programs & Websites
ja: 4 - プログラムとウェブサイトの運営

source: 4 = Force
ja: 4 = 警告せずに閉じる

source: 4 = Omit time marker (e.g. AM/PM).
ja: 4 = タイムマーカーを省略します（例：AM/PM）。

source: 4 = Use alternate calendar (if any).
ja: 4 = 代替カレンダーを使用する（ある場合）。

source: 40239' ...that's it!
ja: 40239' ...以上！

source: 4th mouse button.
ja: マウスの第4ボタン

source: 5 - Function Calls with or without Parentheses
ja: 5 - 括弧の有無による関数呼び出し

source: 5th mouse button.
ja: マウスの第5ボタン

source: 6 - Variables
ja: 6 - 変数

source: 64-bit binary floating-point numbers (the double or binary64 format of the IEEE 754 international standard).
ja: 64ビット2進数浮動小数点数（国際標準規格IEEE754のdoubleまたはbinary64形式）。

source: 64-bit signed integers (int64).
ja: 64ビット符号付き整数（int64）。

source: 7 - Objects
ja: 7 - オブジェクト

source: 8 - Other Helpful Goodies
ja: 8 - その他の役立つグッズ

source: 8 = Always use 24-hour time rather than 12-hour time.
ja: 8 = 12時間制ではなく、常に24時間制を採用しています。

source: 8 = Power down
ja: 8 = 電源オフ

source: 8 = Use Year-Month format (meaningful only when Format is blank; not compatible with 1 and 2).
ja: 8 = 年月日形式を使用する（Formatが空白の場合のみ意味がある、1および2とは互換性がない）。

source: 9000 (i.e. 90 degrees):
ja: 9000（つまり90度）：

source: 9000 (i.e. 90 degrees): right POV
ja: 9000（つまり90度）：正視眼

source: : :btw:: ; Typed in any other combination.
ja: : :btw:: ; 他の組み合わせで入力した。

source: :*:]d:: ; This hotstring replaces "]d" with the current date and time via the functions below.
ja: :*:]d:: ; このホットストリングは、"]d "を以下の関数で現在の日付と時刻に置き換えます。

source: :*:]d:: ; This hotstring replaces "]d" with the current date and time via the statement below.
ja: :*:]d:: ; このホットストリングは、以下のステートメントで「]d」を現在の日付と時刻に置き換えます。

source: :C:BTW:: ; Typed in all-caps.
ja: :C:BTW:: ; オールキャプスで入力。

source: :C:Btw:: ; Typed with only the first letter upper-case.
ja: :C:Btw:: ; 最初の文字だけ大文字で入力した。

source: :X:btw::MsgBox ThisHotkey ; Reports :X:btw
ja: :X:btw::MsgBox ThisHotkey ; メッセージボックスに「:X:btw」と表示されます。

source: ; this.ref retrieves a ByRef object for passing to a COM method.
ja: ; this.ref は COM メソッドに渡すための ByRef オブジェクトを取得する。

source: ; this[] := Val sets the value.
ja: ; this[] := Val が値を設定します。

source: ; this[] retrieves the value.
ja: ; this[]は値を取得します。

source: ; Last parameter is 1 for SB_VERT, 0 for SB_HORZ.
ja: ; SB_VERTの場合は1、SB_HORZの場合は0になります。

source: ; % is used because & was omitted.
ja: ; & が省略されているため、% が使用されています。

source: ; (intentional typo)
ja: ;（意図的な誤字）

source: ; (local time, not UTC). Returns non-zero upon success and zero otherwise.
ja: ; (UTCではなく現地時間)。成功すれば0以外を、そうでなければ0を返す。

source: ; (namely word processors).
ja: ;（すなわちワープロ）。

source: ; (not supported)
ja: ;（サポートされていません）

source: ; *Midnight* of an arbitrary date.
ja: ; 任意の日付の午前0時。

source: ; +RH is identical to +R+H
ja: ; +RHは、+R+Hと同じです。

source: ; -4 is GWL_WNDPROC
ja: ; -4 は GWL_WNDPROC

source: ; ... here make temporary use of the clipboard, such as for quickly pasting large amounts of text ...
ja: ; ... ここで、大量のテキストを素早く貼り付けるなど、クリップボードを一時的に使用する ...

source: ; ... insert here any other actions you want repeated.
ja: ; ...その他、繰り返したい動作があれば、ここに挿入してください。

source: ; ... send keystrokes and mouse clicks ...
ja: ; ... キー操作やマウスクリックを送信する...

source: ; 0x0028 is WM_NEXTDLGCTL
ja: ; 0x0028 は WM_NEXTDLGCTL です。

source: ; 0x0114 is WM_HSCROLL and the 0 after it is SB_LINELEFT.
ja: ; 0x0114 は WM_HSCROLL、その次の 0 は SB_LINELEFT です。

source: ; 0x0114 is WM_HSCROLL and the 1 after it is SB_LINERIGHT.
ja: ; 0x0114 は WM_HSCROLL、その次の 1 は SB_LINERIGHT です。

source: ; 0x0138 is WM_CTLCOLORSTATIC.
ja: ; 0x0138 は WM_CTLCOLORSTATIC です。

source: ; 0x0147 is CB_GETCURSEL (for a DropDownList or ComboBox).
ja: ; 0x0147 は、CB_GETCURSEL（DropDownList または ComboBox の場合）である。

source: ; 0x0188 is LB_GETCURSEL (for a ListBox).
ja: ; 0x0188 は、LB_GETCURSEL（リストボックスの場合）です。

source: ; 0x1304 is TCM_GETITEMCOUNT.
ja: ; 0x1304 は TCM_GETITEMCOUNT である。

source: ; 0x400C is a combination of VT_BYREF and VT_VARIANT.
ja: ; 0x400C は、VT_BYREF と VT_VARIANT の組み合わせである。

source: ; 16-bit signed int
ja: ; 16ビット符号付き整数

source: ; 16-bit unsigned int
ja: ; 16ビット符号無し整数

source: ; 32-bit floating-point number
ja: ; 32ビット浮動小数点数

source: ; 32-bit signed int
ja: ; 32ビット符号付き整数

source: ; 32-bit unsigned int
ja: ; 32ビット符号無し整数

source: ; 64-bit floating-point number
ja: ; 64ビット浮動小数点数

source: ; 64-bit scripts must call SetWindowLongPtr instead of SetWindowLong:
ja: ; 64ビットスクリプトでは、SetWindowLongの代わりにSetWindowLongPtrを呼び出す必要があります。

source: ; 64-bit signed int
ja: ; 64ビット符号付き整数

source: ; 64-bit unsigned int
ja: ; 64ビット符号無し整数

source: ; 7384 = 2 hours + 3 minutes + 4 seconds. It yields:
ja: ; 7384 = 2時間 + 3分 + 4秒。という結果になる：

source: ; 75ms between keys, 25ms between down/up.
ja: ; キー間75ms、ダウン/アップ間25ms。

source: ; 8-bit signed int
ja: ; 8ビット符号付き整数

source: ; 8-bit unsigned int
ja: ; 8ビット符号無し整数

source: ; <-- Increase this value to scroll faster.
ja: ; <-- この値を大きくするとスクロールが速くなります。

source: ; VARIANT (must be combined with VT_ARRAY or VT_BYREF)
ja: ; VARIANT(VT_ARRAYまたはVT_BYREFとの組み合わせが必要)

source: ; A RECT is a struct consisting of four 32-bit integers (i.e. 4*4=16).
ja: ; RECTは，4つの32ビット整数（4*4=16）からなる構造体である．

source: ; A custom color in BGR format.
ja: ; BGR 形式のカスタムカラー。

source: ; Activate the window found above
ja: ; 上記のウィンドウをアクティブにします。

source: ; Activates the window found by WinExist().
ja: ; WinExist()で見つかったウィンドウをアクティブにする。

source: ; Actually the same object in this case.
ja: ; 実はこの場合、同じオブジェクトなんです。

source: ; All the below hotstrings will use "send raw" and will be case sensitive by default.
ja: ; 以下のホットストリングはすべて "send raw"を使用し、デフォルトで大文字と小文字が区別されます。

source: ; Allocate a block of memory for the string to read:
ja: ; 文字列を読み込むためのメモリブロックを確保する：

source: ; Allocate a buffer for use with the ANSI version of wsprintf.
ja: ; ANSI 版 wsprintf で使用するためのバッファを確保する。

source: ; Allocate a buffer for use with the Unicode version of wsprintf.
ja: ; Unicode 版 wsprintf で使用するためのバッファを確保する。

source: ; Allocate memory for a VARIANT to hold our value. VARIANT is used even
ja: ; VARIANTのメモリを確保し、値を保持する。VARIANTは、次のような場合でも使用されます。

source: ; Allocate temporary buffer.
ja: ; 一時的なバッファを確保する。

source: ; Allows a script's hidden main window to be detected.
ja: ; スクリプトの隠されたメインウィンドウを検出できるようにします。

source: ; Alternatively, use the Format function in conjunction with the zero flag:
ja: ; または、Format関数とゼロフラグを組み合わせて使用します：

source: ; An additional Ctrl keystroke is not triggered.
ja: ; 追加のCtrlキー操作は発生しません。

source: ; An object or Map can be used to reduce repetition.
ja: ; オブジェクトやMapを使用することで、繰り返しを減らすことができます。

source: ; Apply offset to convert to UTC.
ja: ; UTC に変換するためのオフセットを適用する。

source: ; Ask the user to pick a folder.
ja: ; フォルダーを選んでもらう。

source: ; Assign explicit copy.
ja: ; 明示的なコピーを割り当てる。

source: ; Assign implicit copy.
ja: ; 暗黙のコピーを割り当てる。

source: ; Assign original array.
ja: ; 元の配列を割り当てる。

source: ; Assigns 33 to a global variable, first creating the variable if necessary.
ja: ; グローバル変数に33を代入する。必要であれば、まず変数を作成する。

source: ; Asterisk is required in this case.
ja: ; この場合、アスタリスクが必要です。

source: ; Avoid fast-mode for subclassing.
ja: ; サブクラス作成時のfast-modeは避けてください。

source: ; Avoids the need for DllCall in the loop to load the library.
ja: ; ループ内でDllCallしてライブラリを読み込む必要を回避。

source: ; Avoids the need to specify the full path of the file below.
ja: ; 以下、ファイルのフルパスを指定する必要を回避することができます。

source: ; Below uses +1 to convert the returned index from zero-based to one-based:
ja: ; Belowでは、返されたインデックスをゼロベースから1ベースに変換するために+1が使用されます：

source: ; Boolean True (-1) or False (0)
ja: ; 真(-1)または偽(0)の論理型。

source: ; Both RootDir and Filename are present.
ja: ; RootDirとFilenameの両方が存在する。

source: ; Bound functions can be used to predefine parameters, making
ja: ; バウンド関数を使用して、パラメータを事前に定義することができます。

source: ; Braces must be used around the section below because it consists of more than one line.
ja: ; 以下の部分は1行以上からなるため、中括弧を使用する必要があります。

source: ; Break out of this loop.
ja: ; このループから抜け出そう。

source: ; But leave the rest below unchanged.
ja: ; しかし、以下の残りの部分は変更しないでください。

source: ; COM object
ja: ; COM オブジェクト

source: ; COM string (Unicode string with length prefix)
ja: ; COM 文字列（Unicode 文字列に長さの接頭辞を付けたもの）。

source: ; Call GetClassInfo to retrieve a pointer to the ITypeInfo interface.
ja: ;GetClassInfo を呼び出し、ITypeInfo インターフェースへのポインタを取得する。

source: ; Call GetDocumentation to get the object's full type name.
ja: ;オブジェクトの完全な型名を得るためにGetDocumentationを呼び出す。

source: ; Call the SayHello function.
ja: ; SayHello関数を呼び出す。

source: ; Called by TaskbarList() on the new instance.
ja: ; 新しいインスタンスに対して TaskbarList() によって呼び出される。

source: ; Called on startup to initialize the class.
ja: ; クラスを初期化するために起動時に呼び出される。

source: ; Caller must ensure that the incoming parameter is a valid date-time stamp
ja: ; 呼び出し側は、入力されるパラメータが有効な日付-時間スタンプであることを確認する必要があります。

source: ; Capturing t would create a circular reference.
ja: ; Capturing tは循環参照を作ることになる。

source: ; Change the masking key to something unassigned such as vkE8.
ja: ; マスキングキーをvkE8などの未割り当てのものに変更する。

source: ; Check class
ja: ; チェッククラス

source: ; Check for VT_ARRAY
ja: ; VT_ARRAYのチェック

source: ; Check specific array type
ja: ; 特定の配列の種類をチェックする

source: ; ChoicePos is now 0 if there is no item selected.
ja: ; 選択されている項目がない場合、ChoicePosは0になるようにしました。

source: ; Clean up.
ja: ;クリーンアップする。

source: ; Clean-up.
ja: ;クリーンアップ。

source: ; Close the Run dialog.
ja: ; 「ファイル名を指定して実行」ダイアログを閉じます。

source: ; Close the file.
ja: ; ファイルを閉じる。

source: ; ComVar: An object which can be used to pass a value ByRef.
ja: ; ComVar:ByRef: 値を渡すために使用できるオブジェクト。

source: ; Connects events to corresponding script functions with the prefix "IE_".
ja: ; イベントと対応するスクリプト関数を "IE_"という接頭辞で接続します。

source: ; Convert from 0-based to 1-based, i.e. so that the first item is known as 1, not 0.
ja: ; 0ベースから1ベースへ、つまり最初の項目が0ではなく1とわかるように変換する。

source: ; Convert the BSTR pointer to a usable string.
ja: ; BSTRポインタを使用可能な文字列に変換する。

source: ; Convert the Buffer to a ClipboardAll and assign it.
ja: ; BufferをClipboardAllに変換してアサインする。

source: ; Convert the parameter from local time to UTC for use with SetSystemTime().
ja: ; SetSystemTime()で使用するため、パラメータをローカル時間からUTCに変換する。

source: ; Convert the specified number of seconds to hh:mm:ss format.
ja: ; 指定された秒数を hh:mm:ss 形式に変換する。

source: ; Converts a string to a binary GUID and returns it in a Buffer.
ja: ; 文字列をバイナリGUIDに変換し、Bufferで返す。

source: ; Copies all files and folders matching SourcePattern into the folder named DestinationFolder and
ja: ; SourcePatternに一致するすべてのファイルとフォルダをDestinationFolderという名前のフォルダにコピーします。

source: ; Copy the Calculator's result into the previously active window.
ja: ; 電卓で計算した結果を、それまでアクティブだったウィンドウにコピーします。

source: ; Correct. Control is omitted.
ja: ; 正しいです。制御が省略されている。

source: ; Correct. Control is specified.
ja: ; 正しい。制御が指定されている。

source: ; Create a new reference to the same object
ja: ; 同じオブジェクトへの新しい参照を作成する

source: ; Create a red brush (0x0000FF is in BGR format).
ja: ; 赤のブラシ（0x0000FFはBGR形式）を作成します。

source: ; Create a static array during the first call, but not on subsequent calls.
ja: ; 最初の呼び出し時には静的配列を作成し、それ以降の呼び出し時には作成しない。

source: ; Create an object and store first reference
ja: ; オブジェクトを作成し、最初のリファレンスを格納する。

source: ; Create an object which can be used to pass the variable ByRef.
ja: ; 変数 ByRef の受け渡しに使用できるオブジェクトを作成する。

source: ; Create new file (overwriting any existing file).
ja: ; 新規ファイルを作成する（既存のファイルを上書きする）。

source: ; Create the TaskbarList object.
ja: ; TaskbarListオブジェクトを作成する。

source: ; Creates a variable local to inner
ja: ; innerのローカルに変数を作成する。

source: ; Ctrl+Shift+E to open folder with current file selected.
ja: ; Ctrl+Shift+E で現在のファイルが選択されているフォルダを開きます。

source: ; Ctrl+Shift+O to open containing folder in Explorer.
ja: ; Ctrl+Shift+Oで、エクスプローラーに含まれるフォルダを開くことができます。

source: ; Currency
ja: ; 通貨

source: ; D means "retrieve folders only".
ja: ; Dは「フォルダだけを取り出す」という意味です。

source: ; Date
ja: ; 日付

source: ; Declaration combined with assignment, described below.
ja: ; 後述するアサインメントと組み合わせた宣言を行います。

source: ; Defaults to "Ptr".
ja: ; デフォルトは "Ptr "です。

source: ; Define the SayHello function.
ja: ; SayHello関数を定義する。

source: ; Delete for security reasons.
ja: ; セキュリティ上、削除してください。

source: ; Disable Alt+key shortcuts for the IME.
ja: ; IME の Alt+key ショートカットを無効にする。

source: ; Disable exemption for any hotkeys/hotstrings below this.
ja: ; これより下のホットキー/ホットストリングの免除を無効にする。

source: ; Display information about the passed function.
ja: ; 渡された関数に関する情報を表示する。

source: ; Display machine type and file size.
ja: ; マシンの種類とファイルサイズを表示します。

source: ; Display the information accumulated by the callback.
ja: ; コールバックで蓄積された情報を表示する。

source: ; Display the log for review.
ja: ; ログを表示させて確認する。

source: ; Display the type name!
ja: ; 型名を表示する!

source: ; Display the vertical or horizontal scroll bar's position in a tooltip:
ja: ; 縦または横スクロールバーの位置をツールチップに表示する：

source: ; Displays "Func"
ja: ; "Func "と表示される。

source: ; Displays "outer value"
ja: ; "外側の値 "を表示する

source: ; Double-deref => 42
ja: ; ダブルデフ⇒42

source: ; Due to fast-mode, this setting will go into effect for the callback too.
ja: ; 高速モードのため、この設定はコールバックにも有効になります。

source: ; Each static declaration's initializer still runs only once.
ja: ; 静的宣言のイニシャライザは一度だけ実行されます。

source: ; EditGetSelectedText because it works in a greater variety of editors
ja: ; EditGetSelectedTextは、より多くのエディターで動作するためです。

source: ; Empty the clipboard
ja: ; クリップボードを空にする

source: ; End this thread so that the one underneath will resume and see the change made by the line above.
ja: ; このスレッドを終了すると、その下にあるスレッドが再開され、上の行で行われた変更を見ることができます。

source: ; Ensure the buffer is large enough to accept the new string.
ja: ; バッファが新しい文字列を受け入れるのに十分な大きさであることを確認する。

source: ; Ensure the cursor is made visible when the script exits.
ja: ; スクリプト終了時にカーソルが表示されるようにする。

source: ; Equivalent to break 2 or goto break_outer.
ja: ; ブレーク2またはgoto break_outerに相当する。

source: ; Equivalent to continue 2 or goto continue_outer.
ja: ; continue 2またはgoto continue_outerに相当する。

source: ; Equivalent to MyFunc(p := unset)
ja: ; MyFunc(p := unset) に相当する。

source: ; Error code (32-bit integer)
ja: ; エラーコード(32ビット整数)

source: ; Example: Pass a VARIANT ByRef to a COM method.
ja: ; 例：COMメソッドにVARIANT ByRefを渡す。

source: ; Exempt the following hotkey from Suspend.
ja: ; 以下のホットキーをSuspendから除外する。

source: ; Extract only the folder name from its full path.
ja: ; フルパスからフォルダ名のみを抽出する。

source: ; Fast-mode is okay because it will be called only from this thread.
ja: ; Fast-modeはこのスレッドからしか呼ばれないので大丈夫です。

source: ; FileAppend is a predefined global variable containing a built-in function.
ja: ; FileAppend は、組み込み関数を含む事前定義されたグローバル変数である。

source: ; Fill the specified rectangle using the brush above.
ja: ; 指定された矩形を上記のブラシで塗りつぶす。

source: ; Find the left-most starting position:
ja: ; 一番左のスタートポジションを探す：

source: ; First copy all the files (but not the folders):
ja: ; まず、すべてのファイルをコピーします（フォルダーはコピーしません）：

source: ; First move all the files (but not the folders):
ja: ; まず、すべてのファイルを移動します（フォルダは移動しません）：

source: ; Floating-point
ja: ; 浮動小数点

source: ; Flush the write buffer.
ja: ; 書き込みバッファをフラッシュする。

source: ; For MouseIsOver, see #HotIf example 1.
ja: ; MouseIsOver については、#HotIf の例 1を参照してください。

source: ; For more detail about the object that e contains, see Error.
ja: ; e が含むオブジェクトの詳細については、Errorを参照してください。

source: ; Force the use of the hook for hotkeys after this point.
ja: ; この時点以降、ホットキーにフックを使用することを強制します。

source: ; Free the memory in case the clipboard was very large.
ja: ; クリップボードが非常に大きい場合に備えて、メモリを解放しています。

source: ; Free the memory.
ja: ; メモリを解放する。

source: ; Generally equivalent to Edit
ja: ; 一般的にEditに相当する。

source: ; Get HWND of first Button
ja: ; 最初のボタンのHWNDを取得する

source: ; Get WMI service object.
ja: ; WMIサービスオブジェクトを取得します。
